DetailLevel Property
 The detail level of this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ViewDetailLevel DetailLevel { get; set; }
Visual Basic
Public Property DetailLevel As ViewDetailLevel
	Get
	Set
Visual C++
public:
property ViewDetailLevel DetailLevel {
	ViewDetailLevel get ();
	void set (ViewDetailLevel value);
}
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentException |  When setting this property: Cannot set ViewDetailLevel to Unassigned
Autodesk.Revit.ExceptionsArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.ExceptionsInvalidOperationException |  When setting this property: View does not have a Detail Level property -or- When setting this property: Detail Level cannot be modified.
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →